// console.log(0.2 + 0.1 === .3);
console.log([] == ![])
// console.log(2 > 3 > 0);
// Задача "Реверс массива"
// Напишите функцию reverseArray которая принимает массив в качестве входного параметра и 
// возвращает новый массив, элементы которого расположены в обратном порядке.
//  Обязательное условие, не использовать встроенные методы, только явные циклы

// function reverseArray(arr){
//    // ваш код
// }
// reverseArray([1, 2, 3, 4, 5]); // [5, 4, 3, 2, 1]
// reverseArray(['x', 'y', 'z']); // ['z', 'y', 'x']

// // Дополнительно попробуй решить задачу несколькими способами, соблюдая обязательное условие

// {
//    for (let i = 1; i <= 10; i++) {
//       let row = '';             
//       for (let k = 1; k <= i; k++) {
//           row += ' * ';           
//       }
//       console.log(row);         
//   }
   
// }